Repository: kubainter/wp_sample-plugin
Catalog: languages/graduates-*.po
Languages: pl_pl

# post type general name
source: Graduates
pl_pl: Absolwenci

# post type singular name
source: Graduate
pl_pl: Absolwent

# admin menu
source: Graduates
pl_pl: Absolwenci

# graduate
source: Add New
pl_pl: Dodaj nowego

source: Add New Graduate
pl_pl: Dodaj nowego absolwenta

source: Edit Graduate
pl_pl: Edytuj absolwenta

source: All Graduates
pl_pl: Wszyscy absolwenci

source: First Name
pl_pl: Imię

source: Last Name
pl_pl: Nazwisko

source: Photo
pl_pl: Zdjęcie

source: Full Name
pl_pl: Pełne imię i nazwisko

source: Description
pl_pl: Opis

source: No graduates found.
pl_pl: Nie znaleziono absolwentów.

source: Graduate Details
pl_pl: Szczegóły absolwenta

source: Current page of the collection.
pl_pl: Bieżąca strona kolekcji.

source: Maximum number of items to be returned in result set.
pl_pl: Maksymalna liczba elementów do zwrócenia w zestawie wyników.

source: Limit results to those matching a string.
pl_pl: Ogranicz wyniki do pasujących do ciągu znaków.

source: Sort collection by object attribute.
pl_pl: Sortuj kolekcję według atrybutu obiektu.

source: Order sort attribute ascending or descending.
pl_pl: Porządek sortowania rosnąco lub malejąco.

source: Missing API key. Please provide X-Graduates-API-Key header.
pl_pl: Brakujący klucz API. Proszę podać nagłówek X-Graduates-API-Key.

source: Invalid API key.
pl_pl: Nieprawidłowy klucz API.

source: API Settings
pl_pl: Ustawienia API

source: API Security Settings
pl_pl: Ustawienia zabezpieczeń API

source: Enable API Security
pl_pl: Włącz zabezpieczenia API

source: Require API key for all requests
pl_pl: Wymagaj klucza API dla wszystkich żądań

source: API Key
pl_pl: Klucz API

source: Configure security settings for the Graduates REST API. When enabled, all API requests must include the API key in the X-Graduates-API-Key header.
pl_pl: Skonfiguruj ustawienia zabezpieczeń dla API REST Absolwentów. Po włączeniu wszystkie żądania API muszą zawierać klucz API w nagłówku X-Graduates-API-Key.

source: Enable API security to view or generate an API key.
pl_pl: Włącz zabezpieczenia API, aby wyświetlić lub wygenerować klucz API.

source: No API key generated yet. Use the "Generate New Key" button below to create one.
pl_pl: Nie wygenerowano jeszcze klucza API. Użyj przycisku "Wygeneruj nowy klucz" poniżej, aby go utworzyć.

source: Use this key in your API requests by adding the X-Graduates-API-Key header.
pl_pl: Użyj tego klucza w żądaniach API, dodając nagłówek X-Graduates-API-Key.

source: Example cURL request:
pl_pl: Przykładowe żądanie cURL:

source: Generate New API Key
pl_pl: Wygeneruj nowy klucz API

source: If you need to regenerate your API key for security reasons, click the button below. Note: This will invalidate your previous key.
pl_pl: Jeśli potrzebujesz wygenerować nowy klucz API ze względów bezpieczeństwa, kliknij przycisk poniżej. Uwaga: Spowoduje to unieważnienie poprzedniego klucza.

source: Generate New Key
pl_pl: Wygeneruj nowy klucz

source: Security check failed.
pl_pl: Weryfikacja bezpieczeństwa nie powiodła się.

source: API key generated successfully.
pl_pl: Klucz API został wygenerowany pomyślnie.

source: API settings updated successfully.
pl_pl: Ustawienia API zostały zaktualizowane pomyślnie.

source: You do not have sufficient permissions to access this page.
pl_pl: Nie masz wystarczających uprawnień, aby uzyskać dostęp do tej strony.

source: Save Settings
pl_pl: Zapisz ustawienia
